{
  "id": "hMnk7lh9M3o",
  "title": "\"Thriller\" (original upload)",
  "description": "Update: 1/29/01  Video can be viewed worldwide except in Germany.  \r\n\r\nWhy  \"Thriller\" ?  visit: http://byronfgarcia.com\r\n\r\n1,500 plus CPDRC inmates of the Cebu Provincial Detention and Rehabilitation Center, Cebu, Philippines at practice! This is not the final routine, and definitely not a punishment! \r\n\r\nWHY THRILLER?\r\n\r\nWhat made me choose Michael Jackson's Thriller for the aerobics routine is that Michael Jackson was a convicted man to the eyes of those who hated him. He would have been in imprisoned had it not been for settlement arrangements, they would say.  Still Michael Jackson's frailty as a human being makes him like one of us -- whether one is a prisoner or not.\r\n\r\nI saw in the lyrics and video of Thriller much of what jail culture is like. Because of the hideous conditions in jails, prisons are like tombs and inmates are like ghoulish creatures. The only difference is that dancers in the MJ Thriller video come with make-up and costumes. The Dancing Inmates come as themselves. People perceived to be evil.\r\n\r\nThe message of the Thriller is a message for all of us. The funk of forty thousand years embedded in the cycle of sin and punishment is a legacy no mere mortal can resist or is capable of resisting. No prison wall can and will stop evil from lurking in the dark. No shackle can stop the beast about to strike. No punitive or brutal treatment is ever too strong to stop creatures crawling in search of blood. Unless we stop breeding demons in jails, gruesome ghouls from every tomb will seal the doom of nations and civilizations.  \r\n\r\nWhat I wanted inmates to do in dancing to the Thriller was for them to be convicted to sin. When I uploaded this on the YouTube, what I wanted viewers to see is how evil dances in our lives without knowing its deathly consequences.\r\n\r\nBut then the song and dance number is but a medium to the message. The message is, governments must stop looking at jails darkly. We have to stop being entertained and thrilled by the sting of sin. We have to look at prisons beyond the cycle of crime and punishment and certainly look inside underlying social, cultural and psychological implications of rehabilitation.\r\n\r\nNo matter how jails are called, prisons by any name are still hell -- the corpse's shell. It is a location in the map that governments would like to hide but cannot conceal. It's like the \"horror looking right between the eyes, you're paralyzed.\" This paralyzing reality is such that if we make jails a living hell, we may be breeding the next generation demons or beast and we may be sending out devils once they are released and reintegrated to society.\r\n\r\nMichael Jackson may have exposed the evils of this Earth in the Thriller but he had a strong message of saving humanity from doom in his \"Heal the World\" where he said \"heal the world, make it a better place, for you and for me and the entire human race.\" Michael Jackson's message was a message of salvation. \"There are people dying if you care enough for the living, make it a better place for you and for me.\" We may have missed out what Michael was trying to say beyond the lyrics. \r\n\r\n\r\nPEACE TO ALL MANKIND!   Byron F. Garcia",
  "publishedAt": "2007-07-17T12:54:18.000Z",
  "importedAt": "2025-04-27T21:01:53.210Z",
  "duration": 266,
  "thumbnail": "https://i.ytimg.com/vi/hMnk7lh9M3o/default.jpg",
  "source": "youtube",
  "channel": {
    "id": "UCAchuWpawGYKkdFsygLfmxA",
    "name": "byronfgarcia"
  }
}